In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['harry', 'rohan', 'pk', ' shubh'],
    "marks":[90,43,45,32],
    "city":['rampur', 'kolkata','barailly', 'ghazipur']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  marks      city
0   harry     90    rampur
1   rohan     43   kolkata
2      pk     45  barailly
3   shubh     32  ghazipur

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_index_false.csv', index=False)

In [7]:
df.head(2)

    name  marks     city
0  harry     90   rampur
1  rohan     43  kolkata

In [8]:
df.tail(2)

     name  marks      city
2      pk     45  barailly
3   shubh     32  ghazipur

In [9]:
df.describe()

           marks
count   4.000000
mean   52.500000
std    25.645013
min    32.000000
25%    40.250000
50%    44.000000
75%    56.250000
max    90.000000

In [10]:
pk = pd.read_csv('pk.csv')

In [11]:
pk

     name  marks      city
0   harry     90    rampur
1   rohan     43   kolkata
2      pk     45  barailly
3   shubh     32  ghazipur

In [12]:
pk['marks']

0    90
1    43
2    45
3    32
Name: marks, dtype: int64

In [13]:
pk['marks'][2]=50

C:\Users\pradkumar\AppData\Local\Temp\ipykernel_16292\2216190248.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  pk['marks'][2]=50

In [14]:
pk['marks']

0    90
1    43
2    50
3    32
Name: marks, dtype: int64

In [15]:
pk.to_csv('pk1.csv')

In [16]:
pk.index = ['first', 'second', 'third', 'fourth']

In [17]:
pk

          name  marks      city
first    harry     90    rampur
second   rohan     43   kolkata
third       pk     50  barailly
fourth   shubh     32  ghazipur

In [18]:
ser = pd.Series(np.random.rand(34))

In [19]:
ser

0     0.485708
1     0.878325
2     0.031710
3     0.330952
4     0.722091
5     0.401338
6     0.078409
7     0.377853
8     0.654797
9     0.113506
10    0.662646
11    0.818352
12    0.410704
13    0.761645
14    0.068654
15    0.505319
16    0.372259
17    0.471390
18    0.144710
19    0.286122
20    0.418407
21    0.247399
22    0.819528
23    0.731678
24    0.871858
25    0.761933
26    0.655081
27    0.558340
28    0.677003
29    0.406837
30    0.681052
31    0.161299
32    0.093327
33    0.015168
dtype: float64

In [20]:
newdf = pd.DataFrame(np.random.rand(334, 5), index = np.arange(334))

In [21]:
newdf

            0         1         2         3         4
0    0.455959  0.159466  0.902229  0.086607  0.374149
1    0.088177  0.801876  0.078959  0.478380  0.528330
2    0.791673  0.067474  0.083919  0.664318  0.001179
3    0.711062  0.614882  0.123287  0.672720  0.786141
4    0.873156  0.266614  0.389797  0.625046  0.008850
..        ...       ...       ...       ...       ...
329  0.993939  0.748476  0.917190  0.117404  0.655313
330  0.801999  0.400027  0.781788  0.198696  0.955068
331  0.379224  0.372710  0.543880  0.900966  0.135244
332  0.024035  0.500453  0.208164  0.029468  0.356039
333  0.703886  0.718055  0.949528  0.831210  0.558856

[334 rows x 5 columns]

In [22]:
newdf.head(100)

           0         1         2         3         4
0   0.455959  0.159466  0.902229  0.086607  0.374149
1   0.088177  0.801876  0.078959  0.478380  0.528330
2   0.791673  0.067474  0.083919  0.664318  0.001179
3   0.711062  0.614882  0.123287  0.672720  0.786141
4   0.873156  0.266614  0.389797  0.625046  0.008850
..       ...       ...       ...       ...       ...
95  0.599229  0.773864  0.175353  0.361902  0.969878
96  0.795905  0.325239  0.248069  0.791432  0.840289
97  0.241218  0.580911  0.559499  0.356851  0.448090
98  0.753654  0.966677  0.703177  0.532728  0.022574
99  0.910578  0.672465  0.427867  0.339522  0.838211

[100 rows x 5 columns]

In [23]:
type(newdf)

pandas.core.frame.DataFrame

In [24]:
type(ser)

pandas.core.series.Series

In [25]:
newdf.describe

<bound method NDFrame.describe of             0         1         2         3         4
0    0.455959  0.159466  0.902229  0.086607  0.374149
1    0.088177  0.801876  0.078959  0.478380  0.528330
2    0.791673  0.067474  0.083919  0.664318  0.001179
3    0.711062  0.614882  0.123287  0.672720  0.786141
4    0.873156  0.266614  0.389797  0.625046  0.008850
..        ...       ...       ...       ...       ...
329  0.993939  0.748476  0.917190  0.117404  0.655313
330  0.801999  0.400027  0.781788  0.198696  0.955068
331  0.379224  0.372710  0.543880  0.900966  0.135244
332  0.024035  0.500453  0.208164  0.029468  0.356039
333  0.703886  0.718055  0.949528  0.831210  0.558856

[334 rows x 5 columns]>

In [26]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.513906    0.499588    0.495408    0.488953    0.518322
std      0.288592    0.280209    0.286006    0.289176    0.289176
min      0.009150    0.000212    0.003261    0.014462    0.000758
25%      0.256022    0.267591    0.234235    0.223927    0.280831
50%      0.524772    0.487510    0.490795    0.473399    0.522244
75%      0.754526    0.744033    0.718081    0.746377    0.774865
max      0.997253    0.999950    0.998609    0.998117    0.994780